# IsConceptualMassFamily Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..IsConceptualMassFamily Property
Family Class See Also
---
Whether the Family is a Conceptual Mass family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsConceptualMassFamily { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsConceptualMassFamily As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsConceptualMassFamily {
	bool get ();
}
```

# See Also
Family Class
Autodesk.Revit.DB Namespace